Autodesk.Revit.DB.GroupLoadOptions.SetDuplicateTypeNamesHandler(Autodesk.Revit.DB.IDuplicateTypeNamesHandler)
Sets a custom duplicate type names handler. If this value is not set, the default handler is used.
By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation.
handler:
The duplicate type names handler.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.GroupLoadOptions.GetDuplicateTypeNamesHandler
Returns current duplicate type names handler or null if none is set.
Since:
2024

Autodesk.Revit.DB.GroupLoadOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.GroupLoadOptions.ReplaceDuplicatedGroups
If there are groups with the same names in source and destination documents set this property to true to replace existing groups,
otherwise the operation will be canceled. The default value is false.
Since:
2024

Autodesk.Revit.DB.GroupLoadOptions.IncludeGrids
True if grids should be brought in from the input file, false otherwise.
The default value is false.
Since:
2024

Autodesk.Revit.DB.GroupLoadOptions.IncludeLevels
True if levels should be brought in from the input file, false otherwise.
The default value is false.
Since:
2024

Autodesk.Revit.DB.GroupLoadOptions.IncludeAttachedDetails
True if attached detail groups should be included, false otherwise.
The default value is true.
Since:
2024

Autodesk.Revit.DB.GroupLoadOptions.#ctor
Creates a new instance of a GroupLoadOptions object.
Since:
2024

Autodesk.Revit.DB.GroupLoadOptions
A class containing options for loading a group from a file.
Since:
2024